In [1]:
import pandas as pd
import numpy as np

## 1. Creating a DataFrame from an array

### 1.1 Option 1

In [3]:
# Creating an array
data = np.array([[2,6], [3,1], [8,4], [9,7]])

In [12]:
# Crating a dataframe
df = pd.DataFrame(data, index=['row1', 'row2', 'row3', 'row4'], columns=['col1', 'col2'])

In [13]:
# Showing the dataframe
df

      col1  col2
row1     2     6
row2     3     1
row3     8     4
row4     9     7

In [16]:
# Creating an array with list shape
data = [[2,6], [3,1], [8,4], [9,7]]

In [17]:
# Creating a dataframe
df = pd.DataFrame(data, index=['row1', 'row2', 'row3', 'row4'], columns=['col1', 'col2'])

In [18]:
# Showing the dataframe
df

      col1  col2
row1     2     6
row2     3     1
row3     8     4
row4     9     7

## 2. Creating a DataFrame from a dictionary

In [37]:
# Contoh list
buah = ['Apel', 'Jeruk', 'Kelengkeng', 'Jambu Kristal']
harga = [65000, 50000, 45000, 28000]

In [48]:
# Storing list with a dictionary
dict_buah = {"Buah":buah, "Harga":harga}

In [49]:
# Crating a DataFrame
df_buah = pd.DataFrame(ls_buah)

In [50]:
# Showing the DataFrame
df_buah

            Buah  Harga
0           Apel  65000
1          Jeruk  50000
2     Kelengkeng  45000
3  Jambu Kristal  28000

## 3. Creating a DataFrame from a CSV file

In [60]:
# reading the csv file
df_exam = pd.read_csv('StudentsPerformance.csv')

In [61]:
# show first 5 rows in a dataframe
df_exam.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75